Битовые операции

Инверсия - ~ - меняет 0 на 1 и 1 на 0.
~10 будет равно -9, а ~-9 будет равно 8

И - & - складывает побитово в соответствии с таблицей истинности
Используется для проверки, где в переменной стоит 1.
Используется для выключения определенных бит числа

ИЛИ - |
Используется для включения определенных бит числа

ИСКЛЮЧАЮЩЕЕ ИЛИ - XOR - ^
Используется для переключения битов
Используется в шифаровании

Смещение бит

>> - смещение вправо, смещение на 1 бит делит на 2, на 2 бита - делит на 4
<< - смещение влево, смещение на 1 бит умножает на 2, на 2 бита - на 8
