1e2 - это 1 * 10^2
1e-5 - это 1 * 10^-5

Двоичная система счисления
a = 0b001 - присвоить двочиное число, a будет = 1. 0b - это указатель, что далее идет двоичное число
bin(число) - преобразовывает число в двоичное представление

Шестнадцатиричная система счисления
0-9, A-F
A = 10, B = 11 и т.д.
1A = 1*16^1 + A*16^0

2 символа шестнадцатиричной системы описывают любой байт

0x1A - это 1A шестнадцатеричной системы
0x - указатель, что далее идет шестнадцатеричная система

Восьмиричная система счисления
0-7

0o - указатель, что далее идет восьмиричная система

