# С помощью функции range() сформируйте следующую последовательность чисел:
# 0, 1, 2, ..., 10
# Результат выведите в виде последовательности чисел, записанных через пробел в одну строчку.

for i in range(11):
    print(i, end=" ")

# С помощью функции range() сформируйте следующую последовательность чисел:
# 10, 9, 8, ..., 0
# Результат выведите в виде последовательности чисел, записанных через пробел в одну строчку.

for i in range(10, -1, -1):
    print(i, end=" ")

# С помощью функции range() сформируйте следующую последовательность чисел:
# -10, -8, -6, -4, -2
# Результат выведите в виде последовательности чисел, записанных через пробел в одну строчку.

for i in range(-10, -1, 2):
    print(i, end=" ")

#С помощью функции range() сформируйте следующую последовательность чисел:
# 1, 4, 7, 10, 13, 16, 19
#Результат выведите в виде последовательности чисел, записанных через пробел в одну строчку.

for i in range(1, 20, 3):
    print(i, end=" ")