
# синтаксис {key1: value1, ... , keyN: valueN}
# также словари можно задавать с помощью функции dict(ключ1=значение1, ..., ключN=значениеN)

d = {"house" : "дом",
     "car": "машина"}
print(d)

d = dict(one=1, two=2, three=3, four=4)
print(d)

# lst = [[1, 'один'], [2, "два"]]
# dict(lst)
# {1: 'один', 2: 'два'}

# в качестве ключей можно использовать любые неизменяемые данные,
# в качестве значений могут использоваться и изменяемые, и неизменяемые

#len(<словарь>) - количество значений в словаре
#del d[<ключ>] - удалить значение из словаря
# <ключ> in <словарь> - проверить наличие КЛЮЧА в словаре




















